<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
<title>Планирование консультации</title>
</head>
<body>
<p>Даную функцию я не стал реализовывать, т.к. для этого необходимо внести соответствующие изменения в базу данных,
а именно, добавить еще одну таблицу, записи в которой формируются исходя из расписания преподавателя.</p>
<p>После изменений в таблице schedule необходимо сформировать пустые записи на неделю вперед с указанием дат и времени консультации.
Сделать я это смогу, но на данном этапе я отрабатывал работу с сервлетом.
</p>
</body>
</html>